suzuke/DaiSpan/v2/sdkconfig.defaults
# DaiSpan v2 - ESP32-C3 sdkconfig defaults

# Target
CONFIG_IDF_TARGET="esp32c3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=y

# UART
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Task stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_WIFI_TASK_STACK_SIZE=4096

# NVS
CONFIG_NVS_ENCRYPTION=n

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=12
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6

# mDNS
CONFIG_MDNS_MAX_SERVICES=5

# Disable BLE to save flash
CONFIG_BT_ENABLED=n

# HAP (HomeKit Accessory Protocol)
CONFIG_HAP_MFI_TYPE_NONE=y

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Log level
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_MAXIMUM_LEVEL=4
